Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.packer_files.files2: Reading...
data.packer_version.version: Reading...
data.packer_files.files2: Read complete after 0s
data.packer_version.version: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # packer_image.image2 will be created
+ resource "packer_image" "image2" {
+       build_uuid         = (known after apply)
+       directory          = "ubuntu"
+       force              = true
+       id                 = (known after apply)
+       ignore_environment = false
+       name               = (known after apply)
+       triggers           = {
+           "files_hash"     = "c4dbef03b47a789b7814b41b987f445b53605d6de40b81571d6e4bc7d30aa0b7"
+           "packer_version" = "1.8.3"
        }
+       variables          = {
+           "test_var3" = "test 3"
        }
    }

  # random_string.random will be created
+ resource "random_string" "random" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ build_uuid_2   = (known after apply)
+ packer_version = "1.8.3"
╷
│ Warning: Attribute Deprecated
│ 
│   with random_string.random,
│   on main.tf line 24, in resource "random_string" "random":
│   24:   number  = true
│ 
│ **NOTE**: This is deprecated, use `numeric` instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://infra.polarpoint.io/lock?id=polarpoint-io%252Fpacker-maas%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
